In [8]:
import pandas as pd
import plotly.graph_objects as go
import plotly.express as px

# Importação da base de dados:
base = pd.read_csv('dataset.csv')

In [9]:
# Tratamento dos valores categóricos:

base.loc[base['Mês'] == 'Jan', 'Mês'] = 1
base.loc[base['Mês'] == 'Fev', 'Mês'] = 2
base.loc[base['Mês'] == 'Mar', 'Mês'] = 3
base.loc[base['Mês'] == 'Abr', 'Mês'] = 4
base.loc[base['Mês'] == 'Mar', 'Mês'] = 5
base.loc[base['Mês'] == 'Jun', 'Mês'] = 6
base.loc[base['Mês'] == 'Jul', 'Mês'] = 7
base.loc[base['Mês'] == 'Ago', 'Mês'] = 8
base.loc[base['Mês'] == 'Set', 'Mês'] = 9
base.loc[base['Mês'] == 'Out', 'Mês'] = 10
base.loc[base['Mês'] == 'Nov', 'Mês'] = 11
base.loc[base['Mês'] == 'Dez', 'Mês'] = 12

base['Chamadas Realizadas'] = base['Chamadas Realizadas'].astype(int)
base['Dia'] = base['Dia'].astype(int)

base.loc[base['Status de Pagamento'] == 'Pago', 'Status de Pagamento'] = 1
base.loc[base['Status de Pagamento'] == 'Não pago', 'Status de Pagamento'] = 0
base['Status de Pagamento'] = base['Status de Pagamento'].astype(int)

base['Valor Pago'] = base['Valor Pago'].str.lstrip('R$ ')
base['Valor Pago'] = base['Valor Pago'].astype(int)

In [10]:
base

,Status de Pagamento,Dia,Mês,Meio de Propaganda,Valor Pago,Chamadas Realizadas,Duração da chamada,Modelo de Treinamento,Nivel de Treinamento,Código de Área,Equipe,Consultor
0,1,1,4,Televisão,7000000,3,02:00,GK,KJI. L4,A7,Equipe 1,Arthur
1,1,10,8,Televisão,11000000,1,02:00,GK,Pre. L8,B13,Equipe 2,Heitor
2,1,20,9,Website,12000000,3,02:00,GK,Fndn. L5,A1,Equipe 2,Helena
3,1,23,9,Facebook,15000000,1,02:00,GK,Fndn. L5,A2,Equipe 3,Alice
4,1,11,9,Televisão,25000000,2,02:00,GK,Fndn. L3,B13,Equipe 4,Theo
...,...,...,...,...,...,...,...,...,...,...,...,...
1232,0,18,11,Facebook,0,2,12:55,NaN,NaN,A1,Equipe 4,Theo
1233,0,24,11,WhatsApp,0,2,12:55,NaN,NaN,A7,Equipe 2,Heitor
1234,0,9,12,Televisão,0,1,12:55,NaN,NaN,A4,Equipe 2,Laura
1235,0,11,2,Facebook,0,2,12:55,NaN,NaN,B18,Equipe 2,Laura
1236,0,12,3,Televisão,0,2,12:55,NaN,NaN,B18,Equipe 3,Sophia

In [11]:
# Vendas por equipe:

base1 = base.groupby('Equipe')['Valor Pago'].sum().reset_index()
base1

     Equipe  Valor Pago
0  Equipe 1  5288000000
1  Equipe 2  5372000000
2  Equipe 3  2579000000
3  Equipe 4  2751000000

In [12]:
# Chamadas realizadas por equipe:

base2 = base.groupby('Equipe')['Chamadas Realizadas'].sum().reset_index()
base2

     Equipe  Chamadas Realizadas
0  Equipe 1                 1048
1  Equipe 2                 1008
2  Equipe 3                  520
3  Equipe 4                  544